Autodesk.Revit.DB.Structure.RebarConstraintTargetHostFaceType
A type to help identify the individual face on a host element to which a Rebar handle
is constrained.
Remarks:
For some types of host, it is possible to describe the face in terms of recognizable
topology (i.e. Top, Bottom, etc.).  However, for most elements, the face can only be
identified by integer tag.  In all cases, a Pick to the host face can be obtained
by calling RebarConstraint.GetTargetHostFaceReference().
Since:
2014
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraintTargetHostFaceType.Side1
Face forms the interior surface of the host geometry.

Autodesk.Revit.DB.Structure.RebarConstraintTargetHostFaceType.Side0
Face forms the exterior surface of the host geometry.

Autodesk.Revit.DB.Structure.RebarConstraintTargetHostFaceType.End1
Face forms the end surface of the host geometry.

Autodesk.Revit.DB.Structure.RebarConstraintTargetHostFaceType.End0
Face forms the starting end surface of the host geometry.

Autodesk.Revit.DB.Structure.RebarConstraintTargetHostFaceType.Bottom
Face forms the bottom surface of the host geometry.

Autodesk.Revit.DB.Structure.RebarConstraintTargetHostFaceType.Top
Face forms the top surface of the host geometry.

Autodesk.Revit.DB.Structure.RebarConstraintTargetHostFaceType.FaceWithTagId
Face identified by integer tag.